#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# (c) @AlbertEinsteinTG | @Hillard_Har 

class Translation(object):
    
    START_TEXT = """🤓🤹ʜɪ ʜᴇʟᴏ {},🧸
••••••••••••••••••••••••••••••••••••••••••••••
[ 🧐ɪ ᴀᴍ ᴀ sɪᴍᴘʟᴇ ᴀᴅᴠᴀɴᴄᴇᴅ Aᴜᴛᴏ Fɪʟᴛᴇʀ Bᴏᴛ🏇..🧸ᴡᴏʀᴋɪɴɢ ᴏɴ @UM_Requests⚡ ]

Bᴏᴛ sɪᴍᴘʟʏ sᴇᴀʀᴄʜ ғᴏʀ ᴛʜᴇ ғɪʟᴇs ғʀᴏᴍ ᴘʀᴏᴠɪᴅᴇᴅ ᴄʜᴀɴɴᴇʟ ᴀᴄᴄᴏʀᴅɪɴɢ ᴛᴏ ɢɪᴠᴇɴ ᴏ̨ᴜᴇʀʏ ᴀɴᴅ ɢɪᴠᴇs ʟɪɴᴋ ᴛᴏ ᴛʜᴏsᴇ ғɪʟᴇs ᴀs ʙᴜᴛᴛᴏɴs!


🧬ғᴏʀ ᴍᴏʀᴇ ɪɴғᴏ /help....🔭

🔬🧲© ᴄʀᴇᴀᴛᴏʀ : @Deeks_04_8🎩,

\/°•°•°•°•°•°•°•°•[ 🆄🅼🆁 ]°•°•°•°•°•°•°•°•°\/"""





    
    HELP_TEXT = """
💡 𝐁𝐎𝐓'𝐒 𝐇𝐄𝐋𝐏

🚀ᴀᴅᴅ ʙᴏᴛ ᴛᴏ ʏᴏᴜʀ ɢʀᴏᴜᴘ ᴡɪᴛʜ ᴀᴅᴍɪɴ ʀɪɢʜᴛs.

🛸ᴀᴅᴅ ʙᴏᴛ ᴛᴏ ᴄʜᴀɴɴᴇʟs ᴡʜɪᴄʜ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ʟɪɴᴋ ᴡɪᴛʜ ᴀʟʟ ᴀᴅᴍɪɴ ʀɪɢʜᴛs!🏟️

⭕ 𝐌𝐲 𝐂𝐨𝐦𝐦𝐚𝐧𝐝𝐬 (ᴏɴʟʏ ᴡᴏʀᴋs ɪɴ ɢʀᴏᴜᴘ) 🏛️

📌 𝑵𝒐𝒕𝒆🗽

💈(ʏᴏᴜ ɴᴇᴇᴅ ᴛᴏ ʙᴇ ᴀ ᴀᴜᴛʜ ᴜsᴇʀ ɪɴ ᴏʀᴅᴇʀ ᴛᴏ ᴜsᴇ ᴛʜᴇsᴇ ᴄᴏᴍᴍᴀɴᴅs)💈

[ ∆ ] /add ᴄʜᴀɴɴᴇʟɪᴅ/ᴄʜᴀɴɴᴇʟᴜsᴇʀɴᴀᴍᴇ - ᴄᴏɴɴᴇᴄᴛ ᴄʜᴀɴɴᴇʟ(s) ᴛᴏ ʏᴏᴜʀ ɢʀᴏᴜᴘ.

📌 𝑵𝒐𝒕𝒆 : ʏᴏᴜ ᴄᴀɴ ɢᴇᴛ ʏᴏᴜʀ ᴄʜᴀɴɴᴇʟ ɪᴅ ғʀᴏᴍ @ShowJsonBot,🤹

[ ∆ ]  /del ᴄʜᴀɴɴᴇʟɪᴅ/ᴄʜᴀɴɴᴇʟᴜsᴇʀɴᴀᴍᴇ - ᴅɪsᴄᴏɴɴᴇᴄᴛ ᴄʜᴀɴɴᴇʟ ғʀᴏᴍ ɢʀᴏᴜᴘ

[ ∆ ] /delall - ʀᴇᴍᴏᴠᴇs ᴀʟʟ ᴄᴏɴɴᴇᴄᴛᴇᴅ ᴄʜᴀɴɴᴇʟ(s) ᴀɴᴅ ғɪʟᴛᴇʀs ғʀᴏᴍ ɢʀᴏᴜᴘ!

📌 𝑵𝒐𝒕𝒆 : ᴅᴏɴ'ᴛ ᴀᴅᴅ ᴄᴏᴍᴍᴀɴᴅ ᴅᴇʟᴇᴛᴇ ʙᴏᴛs ɪɴ ɢʀᴏᴜᴘ! ᴏᴛʜᴇʀᴡɪsᴇ, ᴅᴇʟᴀʟʟ ᴄᴏᴍᴍᴀɴᴅ ᴡᴏɴᴛ ᴡᴏʀᴋ

[ ∆ ]  /filterstats - ᴄʜᴇᴄᴋ ᴄᴏɴɴᴇᴄᴛᴇᴅ ᴄʜᴀɴɴᴇʟs ᴀɴᴅ ɴᴜᴍʙᴇʀ ᴏғ ғɪʟᴛᴇʀs.


😅 ɴᴏ ɴᴇᴇᴅ ᴀᴅᴅ ᴇᴀᴄʜ ғɪʟᴛᴇʀ ᴀɢᴀɪɴ!📢

📯ʙᴏᴛ ᴡɪʟʟ ᴀᴜᴛᴏᴍᴀᴛɪᴄᴀʟʟʏ sᴇᴀʀᴄʜ ғᴏʀ ʏᴏᴜʀ ғɪʟᴇs ᴀɴᴅ ɢɪᴠᴇ ʟɪɴᴋs ᴛᴏ ᴛʜᴀᴛ!🗡️


© @UNI_MOVIES_BOX | @UM_Requests ⚡

•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•°•"""
            


    
    ABOUT_TEXT = """
📕 𝐀𝐛𝐨𝐮𝐭 𝐌𝐞 ,⚔️

[°=°][°=°][°=°][°=°][°=°][°=°][°=°][°=°]

○ ᴍʏ ɴᴀᴍᴇ : υмя мονιєѕ ∂οиєя.

○ ʟᴀɴɢᴜᴀɢᴇ : ᴘʏᴛʜᴏɴ .

○ ғʀᴀᴍᴇᴡᴏʀᴋ : ᴘʏʀᴏɢʀᴀᴍ .

○ sᴇʀᴠᴇʀ : ʜᴇʀᴏᴋᴜ .

○ ᴠᴇʀsɪᴏɴ : 1.0.0.

○ ᴄʀᴇᴀᴛᴏʀ : @Deeks_04_8 🇮🇳

•∆• ᴊᴏɪɴ  ➠ @UM_Requests •~•

°^°^°^°^°^°^°^°^°^°^°^°^°^°^°^°^°^
"""
